# На вход программе подаётся натуральное число. напишите программу, которая вставляет в заданное число запятые в
# соответствии со стандартным американским соглашением о запятых в больших числах.

# формат входных данных
# На вход программе подаётся натуральное число n, (0 < n < 10^100).

# формат выходных данных
# Программа должна вывести число с запятыми в соответствии с условием задачи.


print('{:,}'.format(int(input())))
